app/controllers/backoffice/admins_controller.rb

INSERT INTO "admins" ("name", "email", "role", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @admin = Admin.new(params_admin) # Cria um novo administrador com o parâmetro
    if @admin.save

UPDATE "admins" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "Danille Block"], ["email", "frankie@yostschmidt.com"], ["updated_at", "2018-08-27 21:26:43.304243"], ["id", 3]]
---
  def update

    if @admin.update(params_admin)

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 2]]
---
  def destroy
    admin_name = @admin.name

    if @admin.destroy

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ?  ORDER BY "admins"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_admin
      @admin = Admin.find(params[:id])