app/controllers/backoffice/categories_controller.rb

INSERT INTO "categories" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Teste"], ["created_at", "2018-08-23 15:44:55.363662"], ["updated_at", "2018-08-23 15:44:55.363662"]]
---
  def create
    @category = CategoryService.create(params_category) # Cria uma nova categoria com o parâmetro da descrição

UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "Teste1"], ["updated_at", "2018-08-23 16:04:49.208339"], ["id", 21]]
---
  def update
    if @category.update(params_category)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 21]]
---
    def set_category
      @category = Category.friendly.find(params[:id])