app/controllers/backoffice/send_mail_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @admin = Admin.find(params[:id])